---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassSurfaceData.SkylightWidth
source: html/4856cafe-222b-44c4-e88a-2c3494e1898b.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceData.SkylightWidth Property

The length dimension to be used for the sides of each individual square skylight
 produced in the grid of auto-generated skylights.

## Syntax (C#)
```csharp
public double SkylightWidth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The skylight width is less than eight inches.